#!/bin/sh
#------------------------------------------------------------------------------
#переход в директорию текущего скрипта
cd $(dirname $(readlink -e $0))
set -e
#------------------------------------------------------------------------------
printf '=%.0s' {1..80} && echo ""
echo '>> '$0
bash /app/scripts/composer-update.sh

cd /var/www/libs
echo '>> '
pwd
ls -l

echo '>> chmod "data"'
chmod -vR 777 /app/www/data
#------------------------------------------------------------------------------
