#!/usr/bin/env bash
#------------------------------------------------------------------------------
#переход в директорию текущего скрипта
cd $(dirname $(readlink -e $0))
#------------------------------------------------------------------------------
# Сборка
#-----
printf '=%.0s' {1..80} && echo ""
echo '>> '$0
. setEnv.sh
echo 'imgName='${imgName}

# Создаем новый образ
docker build --tag ${imgName} .
if [ ! "$?" == "0" ]; then
  echo "-- Error build image ${imgName}"
  exit 1
fi
#------------------------------------------------------------------------------
